{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/koren/Documents/stata.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}22 Feb 2019, 12:25:15

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. edit

. edit

. replace y = .99 in 10
{txt}(1 real change made)

{com}. do "/var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//SD10378.000000"
{txt}
{com}. set obs 100
{txt}{p}
number of observations (_N)  was 100,
now 100
{p_end}

{com}. generate x = uniform()
{err}variable {bf}x{sf} already defined
{txt}{search r(110), local:r(110);}

end of do-file

{search r(110), local:r(110);}

{com}. generate y = uniform()
{err}variable {bf}y{sf} already defined
{txt}{search r(110), local:r(110);}

{com}. replace y = 0.99 in 10
{txt}(0 real changes made)

{com}. 
. do "/var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//SD10378.000000"
{txt}
{com}. generate y = uniform()
{err}variable {bf}y{sf} already defined
{txt}{search r(110), local:r(110);}

end of do-file

{search r(110), local:r(110);}

{com}. do hundred_random_values.do
{txt}
{com}. set obs 100
{txt}{p}
number of observations (_N)  was 100,
now 100
{p_end}

{com}. generate x = uniform()
{err}variable {bf}x{sf} already defined
{txt}{search r(110), local:r(110);}

end of do-file

{search r(110), local:r(110);}

{com}. do hundred_random_values
{txt}
{com}. set obs 100
{txt}{p}
number of observations (_N)  was 100,
now 100
{p_end}

{com}. generate x = uniform()
{err}variable {bf}x{sf} already defined
{txt}{search r(110), local:r(110);}

end of do-file

{search r(110), local:r(110);}

{com}. pwd
{res}/Users/koren/Documents

{com}. cd 
{res}/Users/koren

{com}. cd ..
{res}/Users

{com}. cd koren/Dropbox
{res}/Users/koren/Dropbox

{com}. cd /Users/koren/Dropbox
{res}/Users/koren/Dropbox

{com}. ls

{res}total 655680
-rwxr-xr-x@   1 koren  staff  156269538 Nov 22  2004 63-123_t_2002.tif*
-rw-r--r--@   1 koren  staff     674903 May 11  2015 AL_slides_05112015_CEU.pdf
-rw-r--r--@   1 koren  staff     523385 Jul 19  2015 Allcott 2015 QJE - Site Selection Bias in Program Evaluation.pdf
drwxr-xr-x@   7 koren  staff        224 Feb 17 10:34 Apps/
-rw-r--r--@   1 koren  staff      32457 Aug 29  2013 BoardingPass (1).pdf
-rw-r--r--@   1 koren  staff      90035 Sep 18  2013 Boarding_Pass_BA0865_BUD_LHR_024.pdf
-rw-r--r--@   1 koren  staff      75414 Feb 29  2016 CEU Cover Letter - FINAL.pdf
-rw-r--r--@   1 koren  staff     169715 Feb 29  2016 CEU Resume - FINAL.pdf
-rw-r--r--@   1 koren  staff     545441 Jun  7  2015 COEUREsurveytext (3).odt
-rw-r--r--@   1 koren  staff     500151 Jun  5  2015 COEUREsurveytext.odt
-rw-r--r--@   1 koren  staff    3701122 Sep 24  2017 ERC New Version.m4a
-rw-r--r--@   1 koren  staff     199521 Jul 14  2017 EUB_kotveny.pdf
drwxr-xr-x@  11 koren  staff        352 Feb 17 10:34 Expat/
drwxr-xr-x@  11 koren  staff        352 Feb 16 23:10 Foreign firms/
-rw-r--r--@   1 koren  staff     209007 Jul  1  2015 GVC_charts.xlsx
-rw-r--r--@   1 koren  staff          0 Feb 21 23:47 Icon
-rw-r--r--@   1 koren  staff     163953 Feb 28  2016 Jungle Realms PE.zip
-rwxr-xr-x@   1 koren  staff         64 Mar  3  2012 MacBookPro.key*
-rw-r--r--@   1 koren  staff    3572761 Jun 24  2017 Menetjegy.pdf
-rw-r--r--@   1 koren  staff   34585563 Nov 14  2016 Modern Macro Principles KendallHunt 11-14.pdf
-rw-r--r--@   1 koren  staff    1437072 Sep 12  2017 Palos70_2017_nyomdai-JAV.pdf
drwxr-xr-x@ 384 koren  staff      12288 Feb 17 02:49 Public/
-rw-r--r--@   1 koren  staff     292123 Jan  7  2015 Screenshot 2015-01-07 14.15.11.png
-rw-r--r--@   1 koren  staff      15688 Feb 15  2015 Screenshot 2015-02-15 18.52.57.png
-rw-r--r--@   1 koren  staff     766853 May 18  2015 Screenshot 2015-05-18 11.29.18.png
drwxr-xr-x@ 498 koren  staff      15936 Feb 21 08:17 Screenshots/
-rw-r--r--@   1 koren  staff    9506315 Oct 20  2014 Temple quest.zip
-rwxr-xr-x@   1 koren  staff     130048 Sep 22  2016 adatszerk.xls*
-rw-r--r--@   1 koren  staff     972800 Apr 22  2013 ceu_metl-e57d07cca40b0f352cc51f8077e555030a174f18.tar
-rw-r--r--@   1 koren  staff        802 Sep  3  2014 composer.qpt
-rw-r--r--@   1 koren  staff      65795 Jan 15  2015 dropbox-billing.png
-rw-r--r--@   1 koren  staff    9573190 Jan 30  2014 elastic.tar.gz
-rw-r--r--@   1 koren  staff         32 Apr 23  2018 expressvpn.txt
-rw-r--r--@   1 koren  staff      74240 Aug 26  2016 f-0805v1311_application_form_for_external_academic_funding_final2.doc
drwxr-xr-x@  19 koren  staff        608 Feb 17 05:15 grant/
-rw-r--r--@   1 koren  staff    3045790 May 21  2015 gyorujbarat.pdf
-rw-r--r--@   1 koren  staff    3577448 Jun 24  2017 helyjegy.pdf
-rw-r--r--@   1 koren  staff      20000 Jan 25  2018 julia.ipynb
-rw-r--r--@   1 koren  staff        548 Sep 13  2013 kaptar.md
-rwxr-xr-x@   1 koren  staff    1314142 Nov 27  2017 korenm@ceu.edu.ics*
drwxr-xr-x@  18 koren  staff        576 Feb 17 09:40 learning/
-rw-r--r--@   1 koren  staff       1235 Mar 17  2016 machines.md
drwxr-xr-x@  31 koren  staff        992 Feb 17 02:40 magan/
-rw-r--r--@   1 koren  staff   59010764 Dec  6  2013 manufacturing.dta
-rw-r--r--@   1 koren  staff   19539032 Dec  6  2013 manufacturing.dta.gz
-rw-r--r--@   1 koren  staff       1411 May 30  2017 msc-ba-letter.md
-rw-r--r--@   1 koren  staff      44904 Feb 23  2016 multiunit_firm.pdf
-rw-r--r--@   1 koren  staff      21320 Mar 14  2018 origo.ipynb
drwxr-xr-x@  15 koren  staff        480 Feb 17 09:43 places/
drwxr-xr-x@  13 koren  staff        416 Feb 17 09:40 projects/
drwxr-xr-x@  46 koren  staff       1472 Feb 17 05:15 referee/
-rw-r--r--@   1 koren  staff     212957 Jun 22  2017 revisions.csv
-rw-r--r--@   1 koren  staff      48335 Mar 30  2015 table1.pdf
-rw-r--r--@   1 koren  staff        863 Jul  8  2014 tableR1.csv
drwxr-xr-x@  44 koren  staff       1408 Feb 17 01:13 talks/
drwxr-xr-x@   6 koren  staff        192 Feb 17 09:43 teaching/
drwxr-xr-x@  12 koren  staff        384 Feb 17 05:16 travel/
-rw-r--r--@   1 koren  staff   24264648 Jul 15  2015 ultrakek.tiff
drwxr-xr-x@  48 koren  staff       1536 Feb 17 05:17 writing/

{com}. cd teaching/courses/2019/
{res}/Users/koren/Dropbox/teaching/courses/2019

{com}. ls

{res}total 0
drwxr-xr-x@  6 koren  staff  192 Feb 19 15:06 carpentries/
drwxr-xr-x@  4 koren  staff  128 Feb 17 10:42 data-architecture/
drwxr-xr-x@  3 koren  staff   96 Feb 19 14:52 macro/
drwxr-xr-x@  3 koren  staff   96 Feb 17 10:34 python/
drwxr-xr-x@ 10 koren  staff  320 Feb 17 10:36 research-seminar/

{com}. cd research-seminar/scientific-computing-bootcamp/
{res}/Users/koren/Dropbox/teaching/courses/2019/research-seminar/scientific-computing-bootcamp

{com}. ls

{res}total 8
drwxr-xr-x@ 3 koren  staff   96 Feb 17 10:59 01-command-line/
drwxr-xr-x@ 2 koren  staff   64 Feb 13 12:05 02-plain-text/
drwxr-xr-x@ 2 koren  staff   64 Feb 13 12:05 03-version-control/
drwxr-xr-x@ 3 koren  staff   96 Feb 18 20:14 04-python/
-rw-r--r--@ 1 koren  staff  556 Feb 14 11:23 README.md
drwxr-xr-x@ 9 koren  staff  288 Feb 18 20:14 data/
drwxr-xr-x@ 9 koren  staff  288 Feb 22 12:20 open-trade-data/

{com}. cd open-trade-data
{res}/Users/koren/Dropbox/teaching/courses/2019/research-seminar/scientific-computing-bootcamp/open-trade-data

{com}. pwd
{res}/Users/koren/Dropbox/teaching/courses/2019/research-seminar/scientific-computing-bootcamp/open-trade-data

{com}. ls

{res}total 24
drwxr-xr-x@ 3 koren  staff   96 Feb 22 12:19 CERDI/
drwxr-xr-x@ 4 koren  staff  128 Feb 22 12:19 IMF/
-rw-r--r--@ 1 koren  staff  522 Feb 22 12:19 README.md
drwxr-xr-x@ 3 koren  staff   96 Feb 22 12:19 UN/
-rw-r--r--@ 1 koren  staff  208 Feb 22 12:19 download.sh
-rw-r--r--@ 1 koren  staff  672 Feb 22 12:39 screenlog.0

{com}. do hundred_random_values
{err}{p 0 4 2}
file hundred_random_values.do
not found
{p_end}
{txt}{search r(601), local:r(601);}

{com}. do hundred_random_values
{txt}
{com}. set obs 100
{txt}{p}
number of observations (_N)  was 100,
now 100
{p_end}

{com}. generate x = uniform()
{err}variable {bf}x{sf} already defined
{txt}{search r(110), local:r(110);}

end of do-file

{search r(110), local:r(110);}

{com}. clear

. clear all
{res}
{com}. do hundred_random_values
{txt}
{com}. set obs 100
{txt}{p}
number of observations (_N)  was 0,
now 100
{p_end}

{com}. generate x = uniform()
{txt}
{com}. generate y = uniform()
{txt}
{com}. replace y = 0.99 in 10
{txt}(1 real change made)

{com}. 
{txt}end of do-file

{com}. use "/Users/koren/Documents/stata-batch/open-trade-data/CERDI/CERDI-seadistance.dta", clear

. browse

. pwd
{res}/Users/koren/Documents/stata-batch/open-trade-data/CERDI

{com}. cd ../../
{res}/Users/koren/Documents/stata-batch

{com}. ls

{res}total 0
drwxr-xr-x  8 koren  staff  256 Feb 22 13:20 open-trade-data/

{com}. clear

. use open-trade-data/CERDI/CERDI-seadistance.dta

. * relative path is fine

. cd ..
{res}/Users/koren/Documents

{com}. use open-trade-data/CERDI/CERDI-seadistance.dta
{err}{p 0 4 2}
file open-trade-data/CERDI/CERDI-seadistance.dta
not found
{p_end}
{txt}{search r(601), local:r(601);}

{com}. cd stata-batch
{res}/Users/koren/Documents/stata-batch

{com}. bro

. * aside

. rename sea sea
{res}
{com}. * DONT EVER DO THIS

. * avoid abbreviation

. browse

. * TASK: which countries are shorter distance by road from Budapest. create a .csv file if ISO codes

. clear

. use open-trade-data/CERDI/CERDI-seadistance

. bro

. bro if iso1=="HUN"

. bro iso1 iso2 roaddistance if iso1=="HUN"

. * H1: roaddistance is missing when cannot be reached on land

. * contradict H1: HUN-POL

. * NEW TASK: save countries within 2000km on sea

. bro iso1 iso2 seadistance  if iso1=="HUN"

. bro

. bro if iso1 =="HUN"

. bro if iso1 =="FRA"

. * capitalport1 is distance of a SINGLE sea port to capital1, therefore unique value by iso1

. bro if missing(capitalport1 )

. * missing(capitalport1 ) is 0

. do calculate_distances
{err}{p 0 4 2}
file calculate_distances.do
not found
{p_end}
{txt}{search r(601), local:r(601);}

{com}. cd code/
{res}/Users/koren/Documents/stata-batch/code

{com}. do calculate_distances
{txt}
{com}. * first you go to port, then ship by sea, then go from port to capital
. generate total_distance = capitalport1 + seadistance + capitalport2
{txt}(21,201 missing values generated)

{com}. label var total_distance "Total distance between capitals (by sea, km)"
{txt}
{com}. 
. keep if total_distance <= 2000
{txt}(50,314 observations deleted)

{com}. 
{txt}end of do-file

{com}. count
  {res}988

{com}. ** STATA convention: missing is greater than any number

. pwd
{res}/Users/koren/Documents/stata-batch/code

{com}. ls

{res}total 8
-rw-r--r--@ 1 koren  staff  314 Feb 22 14:05 calculate_distances.do
-rw-r--r--@ 1 koren  staff    0 Feb 22 13:35 create_analysis_sample.do
-rw-r--r--  1 koren  staff    0 Feb 22 13:40 read_analysis_sample.do
-rw-r--r--  1 koren  staff    0 Feb 22 13:38 write_countries_csv.do

{com}. do create_analysis_sample
{txt}
{com}. * relative path to data folder
. use ../open-trade-data/CERDI/CERDI-seadistance.dta, clear
{txt}
{com}. * as opposed to: /Users/koren/Documents/stata-batch/open-trade-data/CERDI/CERDI-seadistance.dta
. * as opposed to: cd /Users/koren/Documents/stata-batch/open-trade-data/CERDI/
. * as opposed to: global path = /Users/koren/Documents/stata-batch/open-trade-data/CERDI/ (this is second best)
. 
. keep if iso1=="HUN"
{txt}(51,076 observations deleted)

{com}. 
. * all countries with missing values are coastal
. mvencode capitalport*, mv(0)
{txt}capitalport2:{col 15}already 0 in {res}  26 {txt}observations
{err}no action taken
{txt}{search r(9), local:r(9);}

end of do-file

{search r(9), local:r(9);}

{com}. bro

. help mvencode

. do create_analysis_sample
{txt}
{com}. * relative path to data folder
. use ../open-trade-data/CERDI/CERDI-seadistance.dta, clear
{txt}
{com}. * as opposed to: /Users/koren/Documents/stata-batch/open-trade-data/CERDI/CERDI-seadistance.dta
. * as opposed to: cd /Users/koren/Documents/stata-batch/open-trade-data/CERDI/
. * as opposed to: global path = /Users/koren/Documents/stata-batch/open-trade-data/CERDI/ (this is second best)
. 
. keep if iso1=="HUN"
{txt}(51,076 observations deleted)

{com}. 
. * all countries with missing values are coastal
. mvencode capitalport*, mv(0) override
{txt}capitalport2:{col 15}{res}53{txt} missing values recoded

{com}. 
. save ../analysis_sample/distance-to-hungary.dta, replace
{txt}(note: file ../analysis_sample/distance-to-hungary.dta not found)
file ../analysis_sample/distance-to-hungary.dta saved

{com}. 
{txt}end of do-file

{com}. bro

. do write_countries_csv
{txt}
{com}. keep iso2
{txt}
{com}. * use expressive variable name
. rename iso2 iso_3166_country_code
{res}{txt}
{com}. export delimited using ../output/nearby-countries.csv, replace
{res}{txt}(note: file ../output/nearby-countries.csv not found)
{txt}file ../output/nearby-countries.csv saved

{com}. 
{txt}end of do-file

{com}. ** last time we ran analysis was command 78

. clear all
{res}
{com}. do create_analys_sample
{err}{p 0 4 2}
file create_analys_sample.do
not found
{p_end}
{txt}{search r(601), local:r(601);}

{com}. do create_analysis_sample
{txt}
{com}. * relative path to data folder
. use ../open-trade-data/CERDI/CERDI-seadistance.dta, clear
{txt}
{com}. * as opposed to: /Users/koren/Documents/stata-batch/open-trade-data/CERDI/CERDI-seadistance.dta
. * as opposed to: cd /Users/koren/Documents/stata-batch/open-trade-data/CERDI/
. * as opposed to: global path = /Users/koren/Documents/stata-batch/open-trade-data/CERDI/ (this is second best)
. 
. keep if iso1=="HUN"
{txt}(51,076 observations deleted)

{com}. 
. * all countries with missing values are coastal
. mvencode capitalport*, mv(0) override
{txt}capitalport2:{col 15}{res}53{txt} missing values recoded

{com}. 
. save ../analysis_sample/distance-to-hungary.dta, replace
{txt}file ../analysis_sample/distance-to-hungary.dta saved

{com}. 
{txt}end of do-file

{com}. do read_analysis_sample
{txt}
{com}. use ../analysis_sample/distance-to-hungary.dta, clear
{txt}
{com}. 
{txt}end of do-file

{com}. do calculate_distances
{txt}
{com}. * first you go to port, then ship by sea, then go from port to capital
. generate total_distance = capitalport1 + seadistance + capitalport2
{txt}
{com}. label var total_distance "Total distance between capitals (by sea, km)"
{txt}
{com}. 
. * beware: missing is greater than any number
. drop if total_distance > 2000 & !missing(total_distance)
{txt}(215 observations deleted)

{com}. 
{txt}end of do-file

{com}. do write_countries_csv
{txt}
{com}. keep iso2
{txt}
{com}. * use expressive variable name
. rename iso2 iso_3166_country_code
{res}{txt}
{com}. export delimited using ../output/nearby-countries.csv, replace
{res}{txt}file ../output/nearby-countries.csv saved

{com}. 
{txt}end of do-file

{com}. do 01_create_analysis_sample
{txt}
{com}. * relative path to data folder
. use ../open-trade-data/CERDI/CERDI-seadistance.dta, clear
{txt}
{com}. * as opposed to: /Users/koren/Documents/stata-batch/open-trade-data/CERDI/CERDI-seadistance.dta
. * as opposed to: cd /Users/koren/Documents/stata-batch/open-trade-data/CERDI/
. * as opposed to: global path = /Users/koren/Documents/stata-batch/open-trade-data/CERDI/ (this is second best)
. 
. keep if iso1=="HUN"
{txt}(51,076 observations deleted)

{com}. 
. * all countries with missing values are coastal
. mvencode capitalport*, mv(0) override
{txt}capitalport2:{col 15}{res}53{txt} missing values recoded

{com}. 
. save ../analysis_sample/distance-to-hungary.dta, replace
{txt}file ../analysis_sample/distance-to-hungary.dta saved

{com}. 
{txt}end of do-file

{com}. do master
{txt}
{com}. do 01_create_analysis_sample
{txt}
{com}. * relative path to data folder
. use ../open-trade-data/CERDI/CERDI-seadistance.dta, clear
{txt}
{com}. * as opposed to: /Users/koren/Documents/stata-batch/open-trade-data/CERDI/CERDI-seadistance.dta
. * as opposed to: cd /Users/koren/Documents/stata-batch/open-trade-data/CERDI/
. * as opposed to: global path = /Users/koren/Documents/stata-batch/open-trade-data/CERDI/ (this is second best)
. 
. keep if iso1=="HUN"
{txt}(51,076 observations deleted)

{com}. 
. * all countries with missing values are coastal
. mvencode capitalport*, mv(0) override
{txt}capitalport2:{col 15}{res}53{txt} missing values recoded

{com}. 
. save ../analysis_sample/distance-to-hungary.dta, replace
{txt}file ../analysis_sample/distance-to-hungary.dta saved

{com}. * always add a new line at end
. 
{txt}end of do-file

{com}. do 02_read_analysis_sample
{txt}
{com}. use ../analysis_sample/distance-to-hungary.dta, clear
{txt}
{com}. 
{txt}end of do-file

{com}. do 03_calculate_distances
{txt}
{com}. * first you go to port, then ship by sea, then go from port to capital
. generate total_distance = capitalport1 + seadistance + capitalport2
{txt}
{com}. label var total_distance "Total distance between capitals (by sea, km)"
{txt}
{com}. 
. * beware: missing is greater than any number
. drop if total_distance > 2000 & !missing(total_distance)
{txt}(215 observations deleted)

{com}. 
{txt}end of do-file

{com}. do 04_write_countries_csv
{txt}
{com}. keep iso2
{txt}
{com}. * use expressive variable name
. rename iso2 iso_3166_country_code
{res}{txt}
{com}. export delimited using ../output/nearby-countries.csv, replace
{res}{txt}file ../output/nearby-countries.csv saved

{com}. 
{txt}end of do-file

{com}. 
{txt}end of do-file

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/koren/Documents/stata.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}22 Feb 2019, 14:56:20
{txt}{.-}
{smcl}
{txt}{sf}{ul off}